//routes
export const MAIN = "/";
export const GAMEMODE = "/gamemode";
export const PLAY = "/play";
export const MY_STATISTICS = "/mystatistics";
export const TEACHER_ROOM = "/teacherroom";
export const LOGIN = "/login";
export const GAME_OVER = "/gameover";
//enemies
export const enemiesImages = [
  "/images/enemy1.png",
  "/images/enemy2.png",
  "/images/enemy3.png",
  "/images/enemy4.png",
];
export const enemiesComments = [
  "Ты был совсем близок...",
  "Ты был почти прав, но увы...",
  "Очень жаль, но ты немного ошибся",
];
//history mode
export const heroImages = [
  "/images/character1.png",
  "/images/character2.png",
  "/images/character3.png",
  "/images/character4.png",
  "/images/character2.png",
];
export const history = [
  `Привет, меня зовут Женя! 
  Я учусь в средней школе. Передо мной открываются все новые и новые горизонты в обучении. 
  Но мне немного страшно, получится ли у меня и дальше хорошо учиться и быть ответственным ?
  Помоги Жене побороть его страхи: Неуверенность, Лень и Безответственность.
  Пройди вместе с ним задания и заодно проверь свои знания!`,
  `Женя долго страдал от страха математических задач и чувствовал сильный 
  стресс перед каждым уроком. Однако, после того как он записался в математический кружок в 
  рамках школьной программы, он научился контролировать свои эмоции и успешно решать сложные задачи. 
  Это помогло ему справиться со стрессом и стать увереннее в себе на уроках математики.`,
  `Женя был не очень активным и проводил много времени за компьютером, 
  что могло впоследствии негативно сказаться на его успеваемости по математике. Мальчик решил
  присоединиться к математическому клубу, он начал заниматься математикой и 
  постепенно стал более уверенным в своих знаниях. Это помогло ему улучшить свои результаты и стать 
  более успешным на уроках математики.`,
  `Женя порой был очень безответственным и забывал делать домашние задания по математике, 
  что приводило к плохим оценкам и низкой успеваемости. Его учительница по математике 
  порекомендовала ему записаться на дополнительные занятия, которые привели к тому, что он начал более ответственно относиться к своим 
  обязанностям и стал регулярно выполнять домашние задания. Это помогло ему лучше понимать материал и повысить 
  свои оценки на уроках математики.`,
  `Женя решил преодолеть свои страхи и начал активно учиться, читать книги и изучать новые предметы. 
  Он также начал заниматься спортом и участвовать в школьных мероприятиях. Благодаря своей настойчивости и
  усердию, Жене удалось преодолеть свои страхи и стать еще лучше в учебе. Он стал лидером в классе и получил
  много новых друзей. В конце года он успешно сдал контрольные и получил заслуженную награду за отличную учебу. 
  Женя понял, что все возможно, если верить в себя и не бояться преодолевать свои страхи.`,
];